Terraform will perform the following actions:

  # azurerm_role_assignment.static_web_app_adt_owner will be created
  + resource "azurerm_role_assignment" "static_web_app_adt_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9fe361ff-b2a1-43ba-895a-ddc5f944e145"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Digital Twins Data Owner"
      + scope                            = "/subscriptions/673b4b78-11f8-4da7-8199-8a3ca1545cf1/resourceGroups/rg-yzzx-iot/providers/Microsoft.DigitalTwins/digitalTwinsInstances/adt-yzzx-iot"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_static_web_app.main will be updated in-place
  ~ resource "azurerm_static_web_app" "main" {
      ~ app_settings                       = {
          + "ADT_URL"             = "https://adt-yzzx-iot.api.weu.digitaltwins.azure.net"
          + "AZURE_TENANT_ID"     = "d6bc13d4-9f71-4cce-a8cf-87039d919f0c"
            # (2 unchanged elements hidden)
        }
        id                                 = "/subscriptions/673b4b78-11f8-4da7-8199-8a3ca1545cf1/resourceGroups/rg-yzzx-iot/providers/Microsoft.Web/staticSites/stapp-yzzx-iot"
        name                               = "stapp-yzzx-iot"
      - repository_branch                  = "main" -> null
      - repository_url                     = "https://github.com/jacqueskang/yzzx-iot" -> null
        tags                               = {
            "stack" = "yzzx-iot"
        }
        # (9 unchanged attributes hidden)
    }

<!-- Sticky Pull Request CommentTerraform Plan Summary -->